cf/Documents/InventoryTransfer.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>InventoryTransfer</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.GoodsInWarehouses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>WarehouseSender</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WarehouseRecipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/GoodsInWarehouses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>GoodsInWarehouses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/WriteOffMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>WriteOffMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Manually</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/PurchaseInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>PurchaseInvoice</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.GoodsInWarehouses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Services</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/InventoryTransfer/Ext/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	
	WriteOffOrder = Constants.WriteOffOrder.Get();
	
	// Lock balances before reading them (DataLockControlMode = Managed).
	// Old records of this document are removed before posting (Delete records = Automatically),
	// so a repost with a later date does not count them twice.
	ProductsInDocuments.LockGoodsInWarehouses(Products, WarehouseSender);
	
	Query = New Query;
	Query.SetParameter("Ref", 			Ref);	
	Query.SetParameter("PointInTime", 	PointInTime());
	Query.SetParameter("Products", 		Products.UnloadColumn("Product"));
	Query.SetParameter("Warehouse", 	WarehouseSender);
	
	If WriteOffOrder <> Enums.WriteOffMethods.Manually Then

		If WriteOffOrder = Enums.WriteOffMethods.FIFO Then
			BatchOrder = " ASC";
		Else
			BatchOrder = " DESC";
		EndIf;

		Query.Text = 
		"SELECT
		|	InventoryTransferProducts.Product AS Product,
		|	SUM(InventoryTransferProducts.Quantity) AS Quantity,
		|	SUM(InventoryTransferProducts.Amount) AS Amount
		|INTO ProductsOfDocument
		|FROM
		|	Document.InventoryTransfer.Products AS InventoryTransferProducts
		|WHERE
		|	InventoryTransferProducts.Ref = &Ref
		|
		|GROUP BY
		|	InventoryTransferProducts.Product
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ProductsOfDocument.Product AS Product,
		|	ISNULL(GoodsInWarehousesBalance.Batch, VALUE(Document.PurchaseInvoice.EmptyRef)) AS Batch,
		|	ProductsOfDocument.Quantity AS Quantity,
		|	ProductsOfDocument.Amount AS Amount,
		|	ISNULL(GoodsInWarehousesBalance.QuantityBalance, 0) AS QuantityBalance,
		|	ISNULL(GoodsInWarehousesBalance.AmountBalance, 0) AS AmountBalance,
		|	CASE
		|		WHEN ISNULL(GoodsInWarehousesBalance.QuantityBalance, 0) = 0
		|			THEN 0
		|		ELSE ISNULL(GoodsInWarehousesBalance.AmountBalance, 0) / ISNULL(GoodsInWarehousesBalance.QuantityBalance, 0)
		|	END AS Price
		|FROM
		|	ProductsOfDocument AS ProductsOfDocument
		|		LEFT JOIN AccumulationRegister.GoodsInWarehouses.Balance(
		|				&PointInTime,
		|				Product IN (&Products)
		|					AND Warehouse = &Warehouse) AS GoodsInWarehousesBalance
		|		ON ProductsOfDocument.Product = GoodsInWarehousesBalance.Product
		|			AND GoodsInWarehousesBalance.QuantityBalance > 0
		|
		|ORDER BY
		|	ProductsOfDocument.Product,
		|	GoodsInWarehousesBalance.Batch.PointInTime";
		
		Query.Text = Query.Text + BatchOrder;
		
		SelectionProducts = Query.Execute().Select();
		
		CurrentProduct = Undefined;
		QuantityLeft = 0;
		While SelectionProducts.Next() Do
			
			If SelectionProducts.Product <> CurrentProduct Then
				If QuantityLeft > 0 Then
					Cancel = True;
					ErrorMessage = StrTemplate(
						"Not enough %1 units of product %2 in the warehouse %3",
						QuantityLeft,
						CurrentProduct,
						WarehouseSender
					);
					Message(ErrorMessage);
				EndIf;
				CurrentProduct 	= SelectionProducts.Product;
				QuantityLeft 	= SelectionProducts.Quantity;
				
			ElsIf QuantityLeft <= 0 Then
				Continue;
			EndIf;
			
			Price = SelectionProducts.Price;
			
			Quantity = Min(QuantityLeft, SelectionProducts.QuantityBalance);
			If Quantity <= 0 Then
				Continue; // no positive balance: no record, the shortage is reported below
			EndIf;
			
			// The whole batch is taken -> take its whole amount (no rounding remainder left in the batch)
			If Quantity = SelectionProducts.QuantityBalance Then
				Amount = SelectionProducts.AmountBalance;
			Else
				Amount = Round(Quantity * Price, 2);
			EndIf;

			Record = RegisterRecords.GoodsInWarehouses.Add();
			Record.RecordType 	= AccumulationRecordType.Expense;
			Record.Period 		= Date;
			Record.Product 		= SelectionProducts.Product;
			Record.Warehouse 	= WarehouseSender;
			Record.Quantity 	= Quantity;
			Record.Amount 		= Amount;
			Record.Batch 		= SelectionProducts.Batch;

			Record = RegisterRecords.GoodsInWarehouses.Add();
			Record.RecordType 	= AccumulationRecordType.Receipt;
			Record.Period 		= Date;
			Record.Product 		= SelectionProducts.Product;
			Record.Warehouse 	= WarehouseRecipient;
			Record.Quantity 	= Quantity;
			Record.Amount 		= Amount;
			Record.Batch 		= SelectionProducts.Batch;
			
			QuantityLeft = QuantityLeft - Quantity;
		EndDo;
		
		If QuantityLeft > 0 Then
			Cancel = True;
			ErrorMessage = StrTemplate(
				"Not enough %1 units of product %2 in the warehouse %3",
				QuantityLeft,
				CurrentProduct,
				WarehouseSender
			);
			Message(ErrorMessage);
		EndIf;
		
	Else
		Query.Text =
		"SELECT
		|	InventoryTransferProducts.Product AS Product,
		|	InventoryTransferProducts.Batch AS Batch,
		|	SUM(InventoryTransferProducts.Quantity) AS Quantity
		|FROM
		|	Document.InventoryTransfer.Products AS InventoryTransferProducts
		|WHERE
		|	InventoryTransferProducts.Ref = &Ref
		|
		|GROUP BY
		|	InventoryTransferProducts.Product,
		|	InventoryTransferProducts.Batch
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	GoodsInWarehousesBalance.Product AS Product,
		|	GoodsInWarehousesBalance.Batch AS Batch,
		|	CASE
		|		WHEN GoodsInWarehousesBalance.QuantityBalance = 0
		|			THEN 0
		|		ELSE GoodsInWarehousesBalance.AmountBalance / GoodsInWarehousesBalance.QuantityBalance
		|	END AS Price
		|FROM
		|	AccumulationRegister.GoodsInWarehouses.Balance(
		|			&PointInTime,
		|			Product IN (&Products)
		|				AND Warehouse = &Warehouse) AS GoodsInWarehousesBalance";
		
		QueryBatch = Query.ExecuteBatch();
		
		SelectionProducts = QueryBatch[0].Select();
		SelectionBalance  = QueryBatch[1].Select();
		
		Filter = New Structure("Product, Batch");
		While SelectionProducts.Next() Do
			
			FillPropertyValues(Filter, SelectionProducts);
			
			If SelectionBalance.FindNext(Filter) Then
				Price = SelectionBalance.Price;
			Else
				Price = 0;
			EndIf;
			
			Record = RegisterRecords.GoodsInWarehouses.Add();
			Record.RecordType 	= AccumulationRecordType.Expense;
			Record.Period 		= Date;
			Record.Product 		= SelectionProducts.Product;
			Record.Warehouse 	= WarehouseSender;
			Record.Quantity 	= SelectionProducts.Quantity;
			Record.Amount 		= SelectionProducts.Quantity * Price;
			Record.Batch 		= SelectionProducts.Batch;

			Record = RegisterRecords.GoodsInWarehouses.Add();
			Record.RecordType 	= AccumulationRecordType.Receipt;
			Record.Period 		= Date;
			Record.Product 		= SelectionProducts.Product;
			Record.Warehouse 	= WarehouseRecipient;
			Record.Quantity 	= SelectionProducts.Quantity;
			Record.Amount 		= SelectionProducts.Quantity * Price;
			Record.Batch 		= SelectionProducts.Batch;

			SelectionBalance.Reset();
		EndDo;
		
	EndIf;
	
	RegisterRecords.GoodsInWarehouses.Write();

	ProductsInDocuments.CheckGoodsInWarehouseBalance(
		Products.UnloadColumn("Product"),
		WarehouseSender,
		PointInTime(),
		Cancel
	);
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If ValueIsFilled(WarehouseSender) And WarehouseRecipient = WarehouseSender Then
	
		Cancel = True;
		UserMessage = New UserMessage;
		UserMessage.Text = "The warehouse-sender can't have the same value that the warehouse-recipient has";
		UserMessage.Field = "WarehouseRecipient";
		UserMessage.SetData(ThisObject);
		UserMessage.Message();
	
	EndIf;
	
EndProcedure
